// подключаем стандартную библиотеку для
// ввода/вывода, которая содержит функцию printf
#include <stdio.h> 

// создаём основную функцию программы, точку входа,
// без неё программа не запустится
int main() { 
   // объявляем массив символов (строку)
   // и инициализируем его значением "Hello, world!"
   char program[] = "Hello, world!";
   // выводим строку, которая хранится в массиве
   // program, на экран, %s — спецификатор для строк
   printf("%s\n", program);
   // завершаем программу, возвращение 0 означает успешное завершение
   return 0; 
}


// so kann man ein kommentar schreiben //

